%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 本函数用于读取Cache中保存的指定证券代码（多个请用‘，’隔开）相应指定起始和截止日期之间的日
% 行情数据。与writeintocache_backtest一起使用，不可单独使用。
% 这里的日行情数据格式如下：
% 732686	4.460868254	4.48874868	4.419047614	4.453898147	11022101	6.39	215.9386515
% 732687	4.426017721	4.432987827	4.286615588	4.377226974	21426743	6.28	212.2213977
% 732688	4.377226974	4.426017721	4.321466121	4.342376441	9749282     6.23	210.5317369
% 732689	4.328436228	4.377226974	4.314496014	4.377226974	6720529     6.28	212.2213977
% 732690	4.356316654	4.426017721	4.307525908	4.328436228	7996673     6.21	209.8558726
% 日期       前复权开盘   前复权最高   前复权最低   前复权收盘   成交量   不复权收盘  后复权收盘
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

function  output = readfromcache_backtest(SecuCode,StartDate,EndDate,Path_backtest)
global Path_Gildata;
if nargin < 4
    Path_backtest =  strcat(Path_Gildata,'\Backtest\Cache\');
end

Path_dq = strcat(Path_backtest,SecuCode,'.dat');
output = dlmread(Path_dq);

Day = output(:,1);
output = output ((Day >= datenum(StartDate)  &  Day <= datenum(EndDate)),:);

end
